# Задача 6: Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

tiсket = input('Введи шетизначный номер билета: ')
if int(tiсket) <= 99999 or int(tiсket) >= 1000000:
    print('Это не шетизначный номер! Попробуй еще раз=)')
elif (int(tiсket[0]) + int(tiсket[1]) + int(tiсket[2])) == (int(tiсket[3]) + int(tiсket[4]) + int(tiсket[5])):
    print('YES')
elif (int(tiсket[0]) + int(tiсket[1]) + int(tiсket[2])) != (int(tiсket[3]) + int(tiсket[4]) + int(tiсket[5])):
    print('NO')